app/controllers/admin/shops_controller.rb

  def show
    @shop = Shop.find(params[:id])
---
SELECT "shops".* FROM "shops" WHERE ("shops"."id" = 1) LIMIT 1

  def create
    @shop = Shop.new(params[:shop])

    respond_to do |format|
      if @shop.save
---
INSERT INTO "shops" ("address", "created_at", "logo_url", "name", "telephone", "updated_at") VALUES ('direccion 1', '2010-11-19 18:45:55.215402', 'logo', 'Tienda 1', 'telefono', '2010-11-19 18:45:55.215402')