app/controllers/admin/user_shops_controller.rb

  def show
    @user_shop = UserShop.find(params[:id])
---
SELECT "user_shops".* FROM "user_shops" WHERE ("user_shops"."id" = 1) LIMIT 1

  def edit
    @user_shop = UserShop.find(params[:id])
---
SELECT "user_shops".* FROM "user_shops" WHERE ("user_shops"."id" = 1) LIMIT 1

  def create
    @user_shop = UserShop.new(params[:user_shop])

    respond_to do |format|
      if @user_shop.save
---
INSERT INTO "user_shops" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "name", "remember_created_at", "reset_password_token", "sign_in_count", "updated_at") VALUES ('2010-11-17 19:33:39.327563', NULL, NULL, 'david@gmail.com', '$2a$10$JLdyAyS8QqSg3I29tRBLs.7YtLg.Y2Z5OqUMUje8v8T6O8YzpcxN.', NULL, NULL, NULL, NULL, NULL, 0, '2010-11-17 19:33:39.327563')

  def update
    @user_shop = UserShop.find(params[:id])

    respond_to do |format|
      if @user_shop.update_attributes(params[:user_shop])
---
SELECT "user_shops".* FROM "user_shops" WHERE ("user_shops"."id" = 1) LIMIT 1
UPDATE "user_shops" SET "encrypted_password" = '$2a$10$QZ.00phDxp77xTjE4YlGP.bRGLRdbf0oXPPSvGQx3Se214Tqa030K', "name" = 'David', "updated_at" = '2010-11-17 19:36:41.871330' WHERE ("user_shops"."id" = 1)