app/controllers/admin/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 0) LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "name", "remember_created_at", "reset_password_token", "sign_in_count", "updated_at") VALUES ('2010-11-11 18:25:48.988633', NULL, NULL, 'alvaro.muhlethaler@gmail.com', '$2a$10$o60ePPFaT.AsK9m8QMf0EuxABPHueWWYu3DWiXMhjF8vgPiM/Qf02', NULL, NULL, NULL, NULL, NULL, 0, '2010-11-11 18:25:48.988633')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "users" SET "name" = 'alvaro', "updated_at" = '2010-11-11 18:43:41.698333' WHERE ("users"."id" = 1)

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
DELETE FROM "users" WHERE ("users"."id" = 1)